{
  "name": "makrout dates",
  "ingredients": [
    "Dough:",
    "350 g of wheat semolina (fine or medium) (or 500 g medium semolina + 100 g fine semolina)",
    "35 g of flour (optional)",
    "160 g of fat (melted butter or vegetable oil) (or 200 g of butter)",
    "2/3 cup of orange blossom water (or 3 tbsp)",
    "A pinch of salt",
    "1 glass of water (if semolina 500g/100g)",
    "Filling:",
    "300 g of dates (or 250 g of homemade date paste, or 200 g of store-bought date paste)",
    "1 tbsp of melted butter (or 15 g of soft butter)",
    "1 tbsp of orange blossom water (or 2 tbsp)",
    "1/2 tsp of cinnamon (optional) (or 1 tsp)",
    "A pinch of nutmeg (optional)",
    "50 g of almond powder (optional)",
    "Finishing:",
    "Honey + orange blossom water (for coating)"
  ],
  "steps": [
    "Preparation of the date filling:",
    "If using fresh dates, pit them and steam for 20 to 30 minutes. Blend them with melted butter, orange blossom water, cinnamon, and nutmeg (if used) until smooth. Let cool.",
    "If using store-bought date paste, mix it with soft butter, orange blossom water, cinnamon, and almond powder (if used) to soften it. Form into logs. Set aside.",
    "Preparation of the dough:",
    "In a bowl, mix the semolina and flour (if used) with salt.",
    "Pour the melted fat over the semolina. Mix (rub together) for several minutes so the semolina absorbs the fat well. Let rest for one to two hours (for better hydration).",
    "Gradually pour water and orange blossom water over the semolina. Mix with fingertips without kneading until a homogeneous but slightly crumbly dough is obtained.",
    "Shaping:",
    "Divide the semolina dough into equal portions (e.g., four). Roll one portion into a log.",
    "Create a groove in the center of the dough log. Insert a date filling log of the same length into the groove.",
    "Close the dough log by sealing the edges. Roll it several times to smooth the surface.",
    "Decorate the log (using a knife, a wooden stamp, or a makrout mold).",
    "Cut the log into diamond shapes (makrouts). Repeat the process with the remaining dough.",
    "Cooking:",
    "Makrouts can be fried or baked in the oven (preheated to 180°C).",
    "In the oven: Bake for 20 to 30 minutes until lightly golden.",
    "Finishing:",
    "In a saucepan, warm the honey with a little orange blossom water.",
    "Dip the hot makrouts (fried or baked) immediately into the warm honey. Let soak for 1 to 2 minutes.",
    "Drain the makrouts on a rack. They can be stored for several weeks in an airtight container."
  ],
  "references": [
    "https://nadaty.com/blog/detail/recette-makrout-aux-dattes.html",
    "https://mounacuisine.wordpress.com/2016/07/03/makrout-aux-dattes/"
  ]
}