{
  "name": "traditional chebakia",
  "ingredients": [
    "Dough:",
    "500 g flour (or 1 kg)",
    "100 g melted butter (or 1 tea glass of a mixture of butter and oil)",
    "100 ml vegetable oil (or in the mixture)",
    "100 ml warm water (or 1/2 glass of water)",
    "1 egg (or 1 egg yolk)",
    "1 tbsp white vinegar (or 3/4 glass of vinegar)",
    "1 tbsp orange blossom water (or 3/4 glass)",
    "1/2 tsp saffron powder (or a few saffron threads)",
    "1/2 tsp ground cinnamon (or 1 tsp)",
    "1/4 tsp gum arabic (optional) (or a little powdered)",
    "1 pinch of salt",
    "50 g roasted and ground sesame seeds (or 1 bowl of sesame)",
    "1 tsp baking powder (or 1 sachet)",
    "1 glass of almonds (if 1 kg of flour)",
    "1 tsp ground anise (if 1 kg of flour)",
    "1 tsp fresh yeast (if 1 kg of flour)",
    "Vegetable oil (for frying)",
    "Syrup/Finishing:",
    "500 g honey (or sufficient quantity)",
    "100 ml orange blossom water (for the syrup)",
    "1 cinnamon stick (for the syrup)",
    "2 tbsp water (for the syrup)",
    "Sesame seeds (for decoration)"
  ],
  "steps": [
    "Preparing the dough:",
    "If using almonds and sesame, grind them (sometimes with gum arabic and anise) into a praline-like powder. Set aside.",
    "In a large bowl, mix the flour, saffron, cinnamon, gum arabic, salt, ground sesame, and baking powder.",
    "Add the melted butter and oil. Rub the mixture between your hands until it becomes sandy in texture.",
    "In another container, mix the warm water (infused with saffron if using threads), egg, vinegar, and orange blossom water.",
    "Gradually add the liquid mixture to the dry ingredients and knead until you get a smooth and homogeneous dough (it should be firm).",
    "Divide the dough into several balls. Wrap each ball in plastic wrap and let rest for at least 30 minutes (or a few minutes).",
    "Shaping:",
    "On a lightly floured surface, roll out each ball into a very thin sheet (or use a pasta machine).",
    "Using a fluted pastry wheel, cut squares (about 7-8 cm on each side).",
    "In each square, make 4 or 5 parallel cuts in the center without cutting the edges.",
    "Take one corner of the square and pass it through the cuts to form a flower (refer to a video for the technique). Pinch the ends to secure them.",
    "Cooking and Coating:",
    "Heat vegetable oil in a large deep pan.",
    "Fry the chebakias until golden and crispy.",
    "Meanwhile, in a saucepan, heat the honey with the orange blossom water, water, and cinnamon stick until you get a warm or hot syrup.",
    "Drain the fried chebakias and immediately immerse them in the hot honey (the honey must be warm for proper absorption).",
    "Let soak for a few moments (1 to 2 minutes). Drain the pastries.",
    "Place on a serving tray and sprinkle with sesame seeds for decoration.",
    "Store in an airtight container."
  ],
  "references": [
    "https://www.perledoree.fr/chebakia-la-recette-traditionnelle-du-maroc/",
    "https://oklachahiyablog.wordpress.com/2017/05/14/chebakia/"
  ]
}