{
  "name": "harira soup",
  "ingredients": [
    "200 g of chickpeas (dry soaked overnight or canned)",
    "100 g of green lentils (dry)",
    "600 g of lamb (cut into pieces) (optional)",
    "1 kg of ripe tomatoes (peeled and blended) or 350 g of canned tomatoes",
    "2 onions (chopped or sliced)",
    "4 sprigs of fresh coriander (chopped)",
    "4 sprigs of fresh parsley (chopped)",
    "3 stalks of celery (chopped)",
    "2 L of water or 1350 g of water",
    "100 g of vermicelli or orzo pasta (or 20 g of wheat flour as a thickener)",
    "2 tbsp of tomato paste (or 30 g of tomato paste)",
    "1 tbsp of ground ginger (or 2 tsp)",
    "1 tbsp of salt (adjust to taste)",
    "1 tbsp of lemon juice",
    "4 tbsp of ground turmeric",
    "1 tbsp of ground cinnamon",
    "1 tbsp of ras-el-hanout (or spice mix)",
    "Olive oil (a little)"
  ],
  "steps": [
    "In a pot, heat a little olive oil and sauté the onions, coriander, parsley, and celery.",
    "Add the lamb pieces and sauté for a few minutes.",
    "Add the washed and drained lentils.",
    "Incorporate the turmeric, cinnamon, ginger, ras-el-hanout, and tomato paste. Sauté for 5 minutes over medium heat, stirring.",
    "Add the blended tomatoes and cook for an additional 10 minutes.",
    "Add the chickpeas (soaked overnight and drained, or canned to be added later) and cover with boiling water. Season with salt and pepper. Cover and cook until the meat is tender (about 45-60 min).",
    "If using canned chickpeas, add them now.",
    "If using vermicelli, add them and cook until tender (about 10 min).",
    "If using flour as a thickener, vigorously mix the flour with a small amount of water. Gradually add this mixture to the soup while stirring until the desired texture is achieved. Let it thicken for a few minutes.",
    "Add the lemon juice, mix, and serve hot. Traditionally served with dates."
  ],
  "references": [
    "https://cookidoo.fr/recipes/recipe/fr-FR/r4357",
    "https://elhdagafood.ma/soupe-harira-marocaine/"
  ]
}