{
  "name": "traditional sellou",
  "ingredients": [
    "1 kg flour (high-quality wheat flour, roasted)",
    "1.25 kg blanched almonds (fried in oil or roasted in the oven, some finely ground, others coarsely chopped)",
    "1.25 kg sesame seeds (toasted in the oven or in a pan, some ground)",
    "400 g powdered sugar (more or less to taste)",
    "1 and a half tbsp heaping ground green anise (habet hlawa)",
    "1 and a half tbsp heaping ground fennel seeds (nafaa)",
    "2 tbsp heaping ground cinnamon",
    "1 tsp ground gum arabic (ground with a bit of powdered sugar)",
    "1 nutmeg (ground with a bit of powdered sugar) (optional)",
    "550 ml hot sunflower or peanut oil, clarified melted butter (smen), or a mix of both (adjust according to texture)",
    "1/4 tsp salt (flavor enhancer)"
  ],
  "steps": [
    "Preparation of ingredients (can be done over 2 days):",
    "Roast the flour in the oven (preheated to 175°C with convection) while stirring occasionally until it turns a golden color. Let cool.",
    "Toast the sesame seeds in the oven or in a pan. Finely grind some and leave the rest whole (or just toasted).",
    "Blanch the almonds (soak in hot water, boil, then peel). Brown them in hot oil (the same oil that will be used to bind the sellou) or in the oven. Finely grind some (1 kg) and coarsely chop the rest.",
    "Grind the green anise, fennel seeds, gum arabic, and nutmeg (if used) with a bit of powdered sugar.",
    "Assembly:",
    "In a large bowl, mix the roasted flour, ground and chopped almonds, ground and whole sesame seeds, powdered sugar, cinnamon, anise, fennel, gum arabic, and salt. Mix all the dry ingredients well.",
    "Heat the oil, butter, or the mixture of both.",
    "Gradually incorporate the hot fat into the dry ingredients while mixing well. The sellou should have a sandy but fairly compact texture. To test, press a small amount in your hand: it should hold together. Adjust the amount of fat if necessary.",
    "Taste and adjust the sugar to your preference.",
    "Store in an airtight container."
  ],
  "references": [
    "https://poissonnerie-calli.fr/ingredients-essentiels-pour-reussir-le-sellou-marocain-traditionnel",
    "https://gateauetcuisinerachida.com/sellou-marocain-sfouf/"
  ]
}