{
  "name": "coconut ghriba",
  "image": "../images/ghriba.png",
  "ingredients": [
    "150 g of grated coconut",
    "100 g of almond powder (or 250 g of ground peanuts)",
    "30 g of butter in pieces (or 1 tbsp of soft butter)",
    "2 eggs (or 3 large eggs)",
    "60 g of homemade powdered sugar (for the dough or coating)",
    "30 g of sunflower oil",
    "10 g of homemade vanilla sugar (or 1 sachet)",
    "50 g of durum wheat semolina (or no semolina)",
    "The zest of ½ untreated yellow lemon",
    "30 g of orange blossom water (for dipping)",
    "14 g of baking powder (if using peanuts)",
    "1 tbsp of apricot jam or honey (if using peanuts)",
    "1 good pinch of salt (if using peanuts)",
    "2 tablespoons of cocoa powder (if using peanuts)",
    "1 bowl of powdered sugar + 1 tsp of cornstarch (for coating)"
  ],
  "steps": [
    "If the recipe includes semolina and almonds:",
    "Preheat the oven to 200°C (Th. 6-7).",
    "Blend or mix the almond powder, coconut, durum wheat semolina, and lemon zest. Set aside.",
    "Melt the butter. Whisk the eggs, oil, and vanilla sugar.",
    "Transfer the liquid mixture into the almond-coconut preparation and mix with a spatula (or by hand) until a homogeneous dough is obtained.",
    "Shape small balls of dough the size of a walnut. Quickly dip them in orange blossom water, then in powdered sugar.",
    "Place the balls on a baking sheet lined with parchment paper and flatten them slightly.",
    "Bake for 10-12 minutes at 210°C until they crackle and lightly brown. Let cool before enjoying.",
    "If the recipe includes peanuts (with or without cocoa):",
    "Toast the peanut powder in a pan for 5 minutes.",
    "In a bowl, mix the peanuts, coconut, sugar, vanilla sugar, baking powder, cocoa (if used), jam, soft butter, and salt.",
    "Add the eggs beaten into an omelet. Mix by hand until a soft, slightly sticky dough is obtained (add an egg yolk if too dry).",
    "Preheat the oven to 170°C. Line a baking dish with parchment paper.",
    "Form balls, roll them in the powdered sugar + cornstarch mixture.",
    "Place on the baking dish and flatten them slightly.",
    "Bake for 12 to 15 minutes. Let cool completely."
  ],
  "references": [
    "https://cookidoo.fr/recipes/recipe/fr-FR/r703702",
    "https://www.auxdelicesdupalais.net/ghoriba-aux-cacahuetes-et-a-la-noix-de-coco.html"
  ]
}